package com.company;

public class Chair {
    // Интерфейс может быть объявлен членом класса или другого интерфейса. Такой интерфейс
    //называется интерфейсом-членом или вложенным интерфейсом. Вложенный
    //интерфейс может быть объявлен как puЬlic, private или protected. Этим он отличается
    //от интерфейса верхнего уровня, который должен быть объявлен как pub 1 i с
    //или использовать уровень доступа по умолчанию, как отмечалось ранее.

    public interface Furniture{
        public boolean isWooden(String answer);



    }
  }
